W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Val"], ["description", "best ta ever "], ["updated_at", "2020-06-19 21:01:04.641614"], ["id", 5]]
---
    def update
        # debugger
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)