W8D1/RedditReplica/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "blah"], ["description", "blah"], ["user_id", 2], ["created_at", "2020-06-29 20:38:45.663332"], ["updated_at", "2020-06-29 20:38:45.663332"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def update
        @sub = Sub.find(params[:id])