W7D2/MusicAppV2/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hola"], ["created_at", "2020-06-24 00:34:44.663483"], ["updated_at", "2020-06-24 00:34:44.663483"]]
---
    def create
        # debugger
        @band = Band.new(params.require(:band).permit(:name))
        if @band.save